Tarea2/Cilindro/constant/Parametros
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
// Flujo alrededor de un cilindro dentro de un canal recto (Tarea 2).
// Este es el UNICO archivo que hay que editar: lo leen blockMeshDict,
// controlDict, physicalProperties, 0/U y 0/p.
//
//      y
//      ^   upperWall
//    H +--------------------------------------------------+
//      |            |<-B->|                               |
// inlet|            +-----+                               |outlet
//  --> |            | (o) | yc = H/2                      |
//      |            +-----+                               |
//      |                                                  |
//    0 +--------------------------------------------------+--> x
//      0   lowerWall  xc = Lup                     Lup + Ldown

// ---------------------------------------------------------------------------
// Geometria [m]
// ---------------------------------------------------------------------------
D       1;                      // diametro del cilindro (longitud de referencia)
R       #calc "0.5 * $D";       // radio del cilindro

H       #calc "4.0 * $D";       // altura del canal (bloqueo D/H = 25 %)

Lup     #calc "5.0 * $D";       // <-- TU ELIGES: distancia del inlet al CENTRO del cilindro
Ldown   #calc "15.0 * $D";      // distancia del centro del cilindro al outlet

xc      $Lup;                   // centro del cilindro en x
yc      #calc "0.5 * $H";       // centro del cilindro en y (mitad de la altura)
L       #calc "$Lup + $Ldown";  // largo total del canal

zBack   #calc "0.1 * $D";       // espesor en z (caso 2D)

// ---------------------------------------------------------------------------
// Flujo
// ---------------------------------------------------------------------------
Re      100;                            // Reynolds basado en D y Uin  <-- cambiar aqui
nu      1.8440831253e-05;               // viscosidad cinematica del aire [m2/s]
Uin     #calc "$Re * $nu / $D";         // velocidad uniforme de entrada [m/s]

nTc     200;                            // duracion de la simulacion en tiempos convectivos D/Uin

// ---------------------------------------------------------------------------
// Malla
// ---------------------------------------------------------------------------
// Alrededor del cilindro hay una O-grid de 4 bloques que ocupa un cuadrado
// de semilado B centrado en (xc, yc). Debe cumplirse:  R < B < H/2  y  B < Lup.
B       #calc "1.0 * $D";

nTheta  40;     // celdas en cada cuarto de circunferencia (= celdas en cada lado del cuadrado)

// ===================== REFINAMIENTO EN LA PARED DEL CILINDRO ================
// ========================= ESTO LO CALCULAS TU ==============================
// nRad    : numero de celdas en direccion radial, entre el cilindro y el cuadrado
// gradRad : razon (tamano ultima celda, junto al cuadrado) / (tamano primera celda,
//           junto al cilindro). gradRad > 1 => celdas finas en la pared del cilindro.
//
// Formulas utiles (largo radial Lr = B - R en 0, 90, 180, 270 grados;
//                                  Lr = B*sqrt(2) - R en las diagonales):
//     razon entre celdas consecutivas : r  = gradRad^(1/(nRad-1))
//     primera celda (en la pared)     : d1 = Lr * (r - 1) / (r^nRad - 1)
//     ultima celda (en el cuadrado)   : dN = d1 * gradRad
//
// Los valores de abajo son SOLO un placeholder para que la malla se genere.
nRad    40;     // <-- TU CALCULAS
gradRad 20;     // <-- TU CALCULAS
// ============================================================================

// Tamano de celda lejos del cilindro (bloques aguas arriba, aguas abajo y bandas
// superior/inferior). Conviene que sea parecido a 2B/nTheta para que no haya
// saltos de tamano en el borde del cuadrado.
dx      #calc "$D / 20.0";

// ************************************************************************* //
